#define _CRT_SECURE_NO_WARNINGS 1
//浮点型在内存中的存储
#include <stdio.h>
//int main()
//{
//	double b = 1E10;	//科学计数法
//	printf("%lf\n", b);	//10000000000.000000
//	return 0;
//}

//整型和浮点型在内存中的存储是不同的
//9.0
//(-1)^s * 1.001 * 2^E
//(-1)^0 * 1.001 * 2^3
//S:0 | 1
//M:1≤M<2 ，也就是说，M可以写成 1.xxxxxx 的形式，其中xxxxxx表示小数部分
//E:（unsigned int）如果E为8位，它的取值范围为0~255；如果E为11位，它的取值范围为0~2047
//对于8位的E，这个中间数是127；对于11位的E，这个中间数是1023
//2^10的E是10，所以保存成32位浮点数时，必须保存成10+127=137，即10001001 = 0111 1111 +0000 1010
//0000 1010  --- 10
//0111 1111  --- 127
//1000 1001  --- 137
/*根据国际标准IEEE（电气和电子工程协会） 754，任意一个二进制浮点数V可以表示成下面的形式：
(-1)^S * M * 2^E
(-1)^S表示符号位，当S=0，V为正数；当S=1，V为负数。
M表示有效数字，大于等于1，小于2。
2^E表示指数位。
*/
int main()
{
	int n = 9;	
	//00000000 00000000 00000000 00001001 - 补码
	// 
	float* pFloat = (float*)&n;//强制类型转换
	printf("n的值为：%d\n", n);//9
	//0 00000000 00000000000000000001001 -- +0
	//（-1）^0*0.00000000000000000001001*2^-126 = 0
	printf("*pFloat的值为：%f\n", *pFloat);//0.000000
	*pFloat = 9.0;
	//1001.0
	// 浮点型
	//0 10000010 00100000000000000000000
	// 整型
	//01000001000100000000000000000000	= 1091567616
	printf("num的值为：%d\n", n);//1091567616
	// 浮点型
	//0 10000010 00100000000000000000000
	printf("*pFloat的值为：%f\n", *pFloat);//9.000000
	return 0;
}
//int main()
//{
//	float f = 5.5;
//	//5.5
//	//101.1
//	//(-1)^0*1.011*2^2
//	//S=0
//	//M=1.011
//	//E=2
//	//0 100 0000 1 011 0000 0000 0000 0000 0000
//	//0x30b00000
//	return 0;
//}
//E为全0或者全1，都是有规定的